#+STARTIP: overview

** avy
#+begin_src emacs-lisp
  (use-package avy
    :ensure t
    :config
    (setq avy-timeout-seconds 0.5)
    :bind
    (("C-c SPC" . avy-goto-char-timer)
     ("M-g g" . avy-goto-line))
    )

  (add-hook 'org-mode-hook
	    (lambda ()
	      (local-unset-key (kbd "C-c SPC"))))
#+end_src

#+RESULTS:
| (lambda nil (local-unset-key (kbd C-c SPC))) | (lambda nil (org-bullets-mode 1)) | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | er/add-org-mode-expansions | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** [elpy] New Python Setup
#+BEGIN_SRC emacs-lisp
  (use-package elpy
    :ensure t
    :init
    (elpy-enable))

  (add-hook 'elpy-mode-hook (lambda ()
			      (add-hook 'before-save-hook
					'elpy-black-fix-code nil t)))

  (when (load "flycheck" t t)
    (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
    (add-hook 'elpy-mode-hook 'flycheck-mode))

  (setq python-flymake-command '("/Users/rjohn/.pyenv/shims/flake8" "--config=/Users/rjohn/flake8.ini" "-"))  
  (setq python-check-command "/Users/rjohn/.pyenv/shims/flake8 --config=/Users/rjohn/flake8.ini")
  (setq elpy-syntax-check-command python-check-command)

  (use-package importmagic
      :ensure t
      :config
      (add-hook 'python-mode-hook 'importmagic-mode))

  (define-key importmagic-mode-map (kbd "C-c C-l") 'importmagic-fix-symbol-at-point)
  ; (setq importmagic-be-quiet t)
  ; (add-to-list 'ivy-ignore-buffers "\\*epc con")

  (setq flycheck-flake8rc "/Users/rjohn/flake8.ini")

  (defun company-yasnippet-or-completion ()
    "Solve company yasnippet conflicts."
    (interactive)
    (let ((yas-fallback-behavior
	   (apply 'company-complete-common nil)))
      (yas-expand)))

  (add-hook 'company-mode-hook
	    (lambda ()
	      (substitute-key-definition
	       'company-complete-common
	       'company-yasnippet-or-completion
	       company-active-map)))

#+END_SRC

#+RESULTS:
| (lambda nil (substitute-key-definition 'company-complete-common 'company-yasnippet-or-completion company-active-map)) | company-mode-set-explicitly |

** org-capture setup
   org-capture setup.  The fun stuff.
   
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-c c") 'org-capture)

     (setq org-capture-templates
	   '(("n" "Note" entry (file+headline "~/Dropbox/src/orgfiles/notes.org" "Notes")
	      "* %?\n%T\n%F\n\n%i")
	     ("m" "Meeting Note" entry (file+olp+datetree "~/Dropbox/src/orgfiles/notes.org" "Meeting Notes")
	      "* %?\n\n")
	     ("l" "Link" entry (file+headline "~/Dropbox/src/orgfiles/notes.org" "Links")
	      "* %? %^L \n%T")
	     ("t" "To Do Item" entry (file+headline "~/Dropbox/src/orgfiles/i.org" "To Do Items")
	      "* TODO %?\n %i\n\n" :prepend t)
	     ("d" "Deadline Item" entry (file+headline "~/Dropbox/src/orgfiles/i.org" "Deadlines")
	      "* TODO %?\nDEADLINE: %^T \n %i\n\n" :prepend t)
	     ("j" "Journal" entry (file+datetree "~/Dropbox/src/orgfiles/journal.org")
	      "* %?\nEntered on %U\n  %i\n  %a\n\n")))
   #+END_SRC

   #+RESULTS:
   | n | Note | entry | (file+headline ~/Dropbox/src/orgfiles/notes.org Notes) | * %? |

** org-agenda
   org-agenda

#+begin_src emacs-lisp :tangle no
  (use-package org-super-agenda
    :ensure t
    :config
    (org-super-agenda-mode)
    )

    (let ((org-super-agenda-groups
	   '((:auto-group t))))
      (org-agenda-list))
#+end_src

   #+BEGIN_SRC emacs-lisp
  (setq org-agenda-files (list "~/Dropbox/src/orgfiles/notes.org"
			       "~/Dropbox/src/orgfiles/journal.org"			     
			       "~/Dropbox/src/orgfiles/i.org"))

  (define-key global-map "\C-ca" 'org-agenda)

  (setq org-agenda-custom-commands
	'(("c" "Simple agenda view"
	   ((agenda "")
	    (alltodo "")))))
   #+END_SRC

   #+RESULTS:
   | c | Simple agenda view | ((agenda ) (alltodo )) |

